nsec/nsec-badge/nrf52/ws2812fx.c
// segment parameters
typedef struct Segment { // 20 bytes
    uint16_t start;
    uint16_t stop;
    uint16_t speed;
    uint8_t  mode;
    bool     reverse;
    uint32_t colors[NUM_COLORS];
} segment;

// segment runtime parameters
typedef struct Segment_runtime { // 16 bytes
    unsigned long next_time;
    uint32_t counter_mode_step;
    uint32_t counter_mode_call;
    uint16_t aux_param;
    uint16_t aux_param2;
} segment_runtime;

typedef struct WS2812FX {
    bool running;
    bool triggered;
    uint8_t brightness;
    uint8_t num_segments;
    uint8_t segment_index;
    segment segments[MAX_NUM_SEGMENTS];
    segment_runtime segment_runtimes[MAX_NUM_SEGMENTS];
} ws2812fx;

ws2812fx *fx;

void init_WS2812FX() {
    RESET_RUNTIME;
    fx = malloc(sizeof(ws2812fx));
    if (fx == NULL) {
        return;
    }
    fx->brightness = DEFAULT_BRIGHTNESS;
    fx->running = false;
    fx->triggered = false;
    fx->num_segments = 1;
    
    for (int i = 0; i < MAX_NUM_SEGMENTS; i++) {
        fx->segments[i].mode = DEFAULT_MODE;
        fx->segments[i].start = 0;
        fx->segments[i].stop = NEOPIXEL_COUNT - 1;
        fx->segments[i].speed = DEFAULT_SPEED;
        for (int k = 0; k < NUM_COLORS; k++) {
            fx->segments[i].colors[k] = DEFAULT_COLOR;
        }
    }

    RESET_RUNTIME;
    nsec_neoPixel_init();
    setBrightness_WS2812FX(fx->brightness);
    nsec_neoPixel_show();
}

void service_WS2812FX() {
  if(fx->running || fx->triggered) {
    uint64_t now = get_current_time_millis();
    bool doShow = false;
    for(uint8_t i=0; i < fx->num_segments; i++) {
      fx->segment_index = i;
      if(now > SEGMENT_RUNTIME.next_time || fx->triggered) {
        doShow = true;
        uint16_t delay = mode[SEGMENT.mode]();
        SEGMENT_RUNTIME.next_time = now + max((int)delay, SPEED_MIN);
        SEGMENT_RUNTIME.counter_mode_call++;
      }
    }
    if(doShow) {
      nrf_delay_ms(1);
      nsec_neoPixel_show();
    }
    fx->triggered = false;
  }
}

void start_WS2812FX() {
  RESET_RUNTIME;
  fx->running = true;
}

void stop_WS2812FX() {
  fx->running = false;
  strip_off_WS2812FX();
}

void trigger_WS2812FX() {
  fx->triggered = true;
}

void setMode_WS2812FX(uint8_t m) {
  RESET_RUNTIME;
  fx->segments[0].mode = constrain_u8(m, 0, MODE_COUNT - 1);
  setBrightness_WS2812FX(fx->brightness);
}

void setSpeed_WS2812FX(uint16_t s) {
  RESET_RUNTIME;
  fx->segments[0].speed = constrain_u8(s, SPEED_MIN, SPEED_MAX);
}

void increaseSpeed_WS2812FX(uint8_t s) {
  uint16_t newSpeed = constrain_u8(SEGMENT.speed + s,
                                SPEED_MIN, SPEED_MAX);
  setSpeed_WS2812FX(newSpeed);
}

void decreaseSpeed_WS2812FX(uint8_t s) {
  uint16_t newSpeed = constrain_u8(SEGMENT.speed - s,
                                 SPEED_MIN, SPEED_MAX);
  setSpeed_WS2812FX(newSpeed);
}

void setColor_WS2812FX(uint8_t r, uint8_t g, uint8_t b) {
  setColor_packed_WS2812FX(((uint32_t)r << 16) | ((uint32_t)g << 8) | b);
}

void setColor_packed_WS2812FX(uint32_t c) {
  RESET_RUNTIME;
  fx->segments[0].colors[0] = c;
  setBrightness_WS2812FX(fx->brightness);
}

void setBrightness_WS2812FX(uint8_t b)
{
  fx->brightness = constrain_u8(b, BRIGHTNESS_MIN, BRIGHTNESS_MAX);
  nsec_neoPixel_set_brightness(fx->brightness);
  nsec_neoPixel_show();
  nrf_delay_ms(1);
}

void increaseBrightness_WS2812FX(uint8_t s) {
  s = constrain_u8(fx->brightness + s, BRIGHTNESS_MIN, BRIGHTNESS_MAX);
  setBrightness_WS2812FX(s);
}

void decreaseBrightness_WS2812FX(uint8_t s) {
  s = constrain_u8(fx->brightness - s, BRIGHTNESS_MIN, BRIGHTNESS_MAX);
  setBrightness_WS2812FX(s);
}

bool isRunning_WS2812FX() {
  return fx->running;
}

uint8_t getMode_WS2812FX(void) {
  return fx->segments[0].mode;
}

uint16_t getSpeed_WS2812FX(void) {
  return fx->segments[0].speed;
}

uint8_t getBrightness_WS2812FX(void) {
  return fx->brightness;
}

uint16_t getLength_WS2812FX(void) {
  return fx->segments[0].stop - fx->segments[0].start + 1;
}

uint8_t getModeCount_WS2812FX(void) {
  return MODE_COUNT;
}

uint8_t getNumSegments_WS2812FX(void) {
  return fx->num_segments;
}

void setNumSegments_WS2812FX(uint8_t n) {
  fx->num_segments = n;
}

uint32_t getColor_WS2812FX(void) {
  return fx->segments[0].colors[0];
}

//Todo c'est pas bon sa
const char* getModeName_WS2812FX(uint8_t m) {
  if(m < MODE_COUNT) {
    return name[m];
  } else {
    return "";
  }
}

void setSegment_WS2812FX(uint8_t n, uint16_t start, uint16_t stop, uint8_t mode, uint32_t color, uint16_t speed, bool reverse) {
  if(n < (sizeof(fx->segments) / sizeof(fx->segments[0]))) {
    if(n + 1 > fx->num_segments) fx->num_segments = n + 1;
    fx->segments[n].start = start;
    fx->segments[n].stop = stop;
    fx->segments[n].mode = mode;
    fx->segments[n].speed = speed;
    fx->segments[n].reverse = reverse;
    fx->segments[n].colors[0] = color;
  }
}

void setSegment_color_array_WS2812FX(uint8_t n, uint16_t start, uint16_t stop, uint8_t mode, const uint32_t colors[], uint16_t speed, bool reverse) {
  if(n < (sizeof(fx->segments) / sizeof(fx->segments[0]))) {
    if(n + 1 > fx->num_segments) fx->num_segments = n + 1;
    fx->segments[n].start = start;
    fx->segments[n].stop = stop;
    fx->segments[n].mode = mode;
    fx->segments[n].speed = speed;
    fx->segments[n].reverse = reverse;

    for(uint8_t i=0; i<NUM_COLORS; i++) {
      fx->segments[n].colors[i] = colors[i];
    }
  }
}

void resetSegments_WS2812FX() {
  memset(fx->segments, 0, sizeof(fx->segments));
  memset(fx->segment_runtimes, 0, sizeof(fx->segment_runtimes));
  fx->segment_index = 0;
  fx->num_segments = 1;
  setSegment_WS2812FX(0, 0, 7, FX_MODE_STATIC, DEFAULT_COLOR, DEFAULT_SPEED, false);
}

/* #####################################################
#
#  Color and Blinken Functions
#
##################################################### */

/*
 * Turns everything off. Doh.
 */
void strip_off_WS2812FX() {
  nsec_neoPixel_clear();
  nsec_neoPixel_show();
}


/*
 * Put a value 0 to 255 in to get a color value.
 * The colours are a transition r -> g -> b -> back to r
 * Inspired by the Adafruit examples.
 */
uint32_t color_wheel_WS2812FX(uint8_t pos) {
  pos = 255 - pos;
  if(pos < 85) {
    return ((uint32_t)(255 - pos * 3) << 16) | ((uint32_t)(0) << 8) | (pos * 3);
  } else if(pos < 170) {
    pos -= 85;
    return ((uint32_t)(0) << 16) | ((uint32_t)(pos * 3) << 8) | (255 - pos * 3);
  } else {
    pos -= 170;
    return ((uint32_t)(pos * 3) << 16) | ((uint32_t)(255 - pos * 3) << 8) | (0);
  }
}


